/**
 * https://github.com/facebook/react-native
 * @flow api数据
 */


export default {
  recommend:{
    "server": {
      "time": 1576082425
    },
    "data": [
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 606926100,
            "price": 1.25,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.5,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "老婆饼（玫瑰味）"
        },
        "couponendtime": 1576943999,
        "mname": "味多美",
        "title": "老婆饼（玫瑰味）1粒",
        "brandname": "味多美",
        "dt": 179,
        "imgurl": "http://p0.meituan.net/w.h/deal/a6ebaaf5960f46cb7d7fa227dd3b17ce33137.jpg@0_0_640_387a|388h_640w_2e_100Q",
        "rate-count": 7705,
        "mlls": "40.067698,116.162068;39.993418,116.421638;39.932725,116.315114;40.031205,116.417454;39.925498,116.615718;39.905723,116.253375;39.946152,116.292933;39.96786,116.30148;39.923503,116.501542;39.913052,116.588741;39.848049,116.324751;40.032819,116.271641;39.8915,116.685248;39.873702,116.634677;39.92918,116.516859;40.100941,116.373772;39.858207,116.423328;39.963332,116.389155;39.793883,116.365058;40.001906,116.373692;39.88361,116.35878;40.042063,116.413881;39.950895,116.55156;39.893015,116.64273;39.762114,116.502749;40.074072,116.334832;39.86708,116.36404;39.993447,116.367979;39.88362,116.42129;39.8823,116.31159;39.732157,116.344724;39.813285,116.402872;39.81758,116.5798;39.905007,116.329188;39.763599,116.213965;39.90471,116.23609;40.374107,116.830388;39.909447,116.212621;39.723691,116.157798;40.372417,116.845312;39.966514,116.287916;40.03091,116.34399;39.927918,116.330109;40.080602,116.33363;39.982709,116.315618;39.790246,116.329262;40.109108,116.661221;40.074473,116.319517;40.05698,116.41315;39.839806,116.285728;39.9038,116.576899;40.224458,116.226612;40.074396,116.408942;39.856088,116.283493;39.98761,116.490632;40.222304,116.261152;39.95812,116.431199;39.879708,116.460774;39.95694,116.286559;39.686029,116.322607;39.884631,116.321443;39.824191,116.298894;40.00121,116.35179;39.967927,116.462016;39.773203,116.330023;39.841277,116.386932;39.87151,116.34807;39.89546,116.678684;39.99107,116.48364;39.823283,116.336698;39.846127,116.354587;39.75668,116.16112;39.968727,116.418686;40.032761,116.31929;39.980259,116.381267;40.024198,116.292964;40.081271,116.362235;39.805099,116.36782;39.967034,116.320001;40.029415,116.436911;39.904847,116.342604;40.008713,116.354281;39.772276,116.539377;39.729243,116.339751;39.92181,116.517356;40.06688,116.414225;39.893376,116.437634;40.028252,116.627994;39.873226,116.476843;39.802005,116.480472;39.805957,116.490298;40.001591,116.407371;39.9295,116.162423;39.861289,116.386572;39.900077,116.280047;39.850569,116.308499;40.083504,116.320156;40.132544,116.427827;39.933045,116.32447;40.00464,116.353",
        "price": 1.25,
        "solds": 143336,
        "digestion": "",
        "end": 1576943999,
        "id": 606926100,
        "state": 32,
        "value": 2.5,
        "nobooking": 1,
        "slug": "606926100",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/a6ebaaf5960f46cb7d7fa227dd3b17ce33137.jpg@126_0_388_388a|267h_267w_2e_100Q",
        "mtitle": "老婆饼（玫瑰味）1粒，提供免费WiFi",
        "smstitle": "味多美老婆饼（玫瑰味）",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1563953354,
        "frontPoiCates": "1,11",
        "subcate": "190",
        "start": 1563953354,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 94,
        "hide": 0,
        "ctype": 2,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 606888388,
            "price": 3.9,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.3,
        "channel": "food",
        "range": "5店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "招牌饮品"
        },
        "couponendtime": 1577030399,
        "mname": "茶大爷",
        "title": "超值饮品2选1",
        "brandname": "茶大爷",
        "dt": 179,
        "imgurl": "http://p0.meituan.net/w.h/deal/2297194178be8e52e24a07c1c8e9e61b23487.jpg@29_0_742_450a|388h_640w_2e_90Q",
        "rate-count": 542,
        "mlls": "39.998581,116.289539;39.951502,116.548007;39.898152,116.419656;39.94009,116.43243;39.979704,116.313821",
        "price": 3.9,
        "solds": 11877,
        "digestion": "",
        "end": 1577030399,
        "id": 606888388,
        "state": 32,
        "value": 13,
        "nobooking": 1,
        "slug": "606888388",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/2297194178be8e52e24a07c1c8e9e61b23487.jpg@175_0_450_450a|267h_267w_2e_90Q",
        "mtitle": "超值饮品2选1，建议单人使用",
        "smstitle": "茶大爷超值饮品2选1",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1563933312,
        "frontPoiCates": "1,11",
        "subcate": "190",
        "start": 1563933312,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 87,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 48810374,
            "price": 13,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.2,
        "channel": "food",
        "range": "161店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "鱼香肉丝套餐"
        },
        "couponendtime": 1580486399,
        "mname": "吉野家",
        "title": "鱼香肉丝饭+冰红茶1份",
        "brandname": "吉野家",
        "dt": 11,
        "imgurl": "http://p0.meituan.net/w.h/deal/6bd62886f66fae73cb25133f72d8981f39464.jpg@0_1_640_387a|388h_640w_2e_100Q",
        "rate-count": 13988,
        "mlls": "39.91529,116.497823;39.925322,116.199273;39.905138,116.122225;40.066455,116.312871;39.724522,116.173893;39.909238,116.41308;40.355975,116.835045;40.072469,116.337205;39.935296,116.112947;39.865899,116.500509;39.892956,116.642587;39.924101,116.354287;39.912572,116.374658;39.985601,116.469158;39.996284,116.47834;39.91334,116.279998;39.906708,116.26414;39.857183,116.293374;40.066712,116.346918;39.896186,116.37534;39.957304,116.462755;39.85818,116.42347;40.374773,116.845537;39.9177,116.52923;39.90763,116.44862;39.840683,116.322087;39.907558,116.475972;39.921636,116.43996;39.686392,116.320808;39.960741,116.445082;39.91832,116.69999;39.79102,116.49924;39.843294,116.427868;40.074922,116.412845;40.010828,116.468304;40.148029,116.288481;39.928066,116.276952;39.91326,116.47567;39.81806,116.58725;39.908388,116.297203;39.893497,116.324306;39.976135,116.307014;39.824523,116.298377;39.804874,116.501365;39.854238,116.28279;39.917706,116.458839;39.895312,116.321111;39.88542,116.31288;39.939825,116.372879;40.219134,116.233044;39.98787,116.3049;40.080223,116.33733;39.888895,116.338056;40.117134,116.414478;39.983838,116.314346;39.924679,116.518238;39.917164,116.361834;39.908974,116.307274;39.95744,116.32242;39.951475,116.548007;39.875804,116.439852;39.976119,116.251762;39.847222,116.555646;39.838123,116.28523;40.132187,116.64666;39.87887,116.312339;39.813959,116.368632;39.900433,116.493265;40.046599,116.432873;40.008613,116.354844;39.984416,116.333864;39.85995,116.39668;40.033687,116.418652;39.81404,116.45462;40.146262,117.094094;39.925132,116.601794;39.960159,116.27999;40.03611,116.30771;39.89374,116.4184;40.461861,115.976118;39.813285,116.402928;40.030576,116.346437;40.098368,116.36672;39.968734,116.325748;39.88078,116.38819;39.857382,116.446809;39.86564,116.4653;40.0962,116.289385;39.924705,116.438514;39.801341,116.480611;40.015327,116.270659;39.97148,116.49058;40.028172,116.311045;39.936728,116.528834;39.847567,116.320236;39.952515,116.356849;40.070317,116.414361;40.05866,116.41542;39.89387,116.459416;39.894138,116.231874",
        "price": 13,
        "solds": 237057,
        "digestion": "",
        "end": 1580486399,
        "id": 48810374,
        "state": 32,
        "value": 21.5,
        "nobooking": 1,
        "slug": "48810374",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/6bd62886f66fae73cb25133f72d8981f39464.jpg@125_0_390_390a|267h_267w_2e_100Q",
        "mtitle": "鱼香肉丝饭+冰红茶1份",
        "smstitle": "吉野家鱼香肉丝饭+冰红茶",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1514304000,
        "frontPoiCates": "1,36",
        "subcate": "209",
        "start": 1514304000,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 84,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 619563064,
            "price": 1,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.5,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "13": "1"
        },
        "couponendtime": 1598889599,
        "mname": "DQ",
        "title": "50元冰淇淋蛋糕代金券1张",
        "brandname": "DQ",
        "dt": 13,
        "imgurl": "http://p0.meituan.net/w.h/deal/570d3ccc2657c668f406baa5a49e3a9d105160.jpg@0_144_2000_1212a|388h_640w_2e_90Q",
        "rate-count": 6,
        "mlls": "39.924109,116.518416;39.978329,116.315311;40.35591,116.835009;39.940646,116.102009;39.935432,116.11338;39.791641,116.339801;39.791109,116.499246;39.865844,116.500464;40.076236,116.319197;39.909619,116.450101;40.015804,116.271109;39.939915,116.372915;40.045699,116.357731;39.735332,116.139478;39.817676,116.292361;40.178902,116.651421;39.925526,116.195317;40.01105,116.469285;39.834211,116.369503;39.92171,116.43999;39.958671,116.288847;39.940243,116.43509;39.860833,116.356494;40.126175,116.652116;39.949071,116.47451;40.220183,116.244012;39.894011,116.478448;39.909675,116.372989;39.99701,116.4782;39.959999,116.433492;39.905085,116.641105;40.234933,116.170364;39.973259,116.294906;39.908009,116.201751;40.096966,116.288933;39.885905,116.420624;39.941615,116.352784;40.31566,116.6318;39.835912,116.288844;40.059765,116.415547;39.896795,116.417517;39.814008,116.368627;39.824985,116.299842;39.745522,116.14093;40.066909,116.346541;39.899121,116.419817;40.035818,116.505872;39.90361,116.63639;39.924291,116.518237;39.865946,116.423094;39.854435,116.366586;40.072119,116.336994;40.14626,117.09456;39.909042,116.416623;39.909962,116.410652;39.882245,116.297295;40.4618,115.976104;39.909758,116.41206;39.923226,116.171546;39.915987,116.436865;39.762991,116.186251;39.998079,116.290193;39.75768,116.33713;39.9817,116.35505;39.91352,116.27969;39.753058,116.210414;39.925123,116.602654;40.070246,116.41467;39.958308,116.286923;39.988523,116.304586;40.316121,116.629967;39.889318,116.337545;39.918247,116.700224;39.85748,116.44704;39.967801,116.325879;39.91719,116.36153;39.837998,116.285502;39.910906,116.372976",
        "price": 1,
        "solds": 8025,
        "digestion": "",
        "end": 1598889599,
        "id": 619563064,
        "state": 32,
        "value": 50,
        "nobooking": 0,
        "slug": "619563064",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/570d3ccc2657c668f406baa5a49e3a9d105160.jpg@250_0_1500_1500a|267h_267w_2e_90Q",
        "mtitle": "50元冰淇淋蛋糕代金券1张，可免费使用包间",
        "smstitle": "DQ冰淇淋蛋糕代金券",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1573456824,
        "frontPoiCates": "402,1,393,11",
        "subcate": "190,278,284",
        "start": 1573456824,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 83,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[3,4]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 47075977,
            "price": 418,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.7,
        "channel": "food",
        "range": "天安门广场",
        "optionalattrs": {
          "11": "{\"startDate\":\"2018-12-30,2019-02-04,2019-04-05,2019-05-01,2019-06-07,2019-09-13,2019-10-01\",\"specialCondition\":\"法定节假日不可用\",\"useDay\":\"1\",\"endDate\":\"2019-01-01,2019-02-10,2019-04-07,2019-05-01,2019-06-09,2019-09-15,2019-10-07\"}",
          "81": "精品烤鸭套餐"
        },
        "couponendtime": 1577375999,
        "mname": "北京全聚德",
        "title": "精品烤鸭3-4人餐1份",
        "brandname": "北京全聚德",
        "dt": 27,
        "imgurl": "http://p0.meituan.net/w.h/deal/f38a659eb827ed9571deddb74db2f388142809.jpg@0_314_1600_969a|388h_640w_2e_90Q",
        "rate-count": 727,
        "mlls": "39.901401,116.39988",
        "price": 418,
        "solds": 6203,
        "digestion": "",
        "end": 1577375999,
        "id": 47075977,
        "state": 32,
        "value": 523,
        "nobooking": 1,
        "slug": "47075977",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/f38a659eb827ed9571deddb74db2f388142809.jpg@1_0_1598_1598a|267h_267w_2e_90Q",
        "mtitle": "精品烤鸭3-4人餐1份",
        "smstitle": "北京全聚德精品烤鸭3-4人餐",
        "festcanuse": 0,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1504755644,
        "frontPoiCates": "59,1,20150",
        "subcate": "135",
        "start": 1504755644,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 66,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 608418706,
            "price": 3,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.4,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "香滑蒸蛋"
        },
        "couponendtime": 1578412799,
        "mname": "真功夫",
        "title": "香滑蒸蛋1份",
        "brandname": "真功夫",
        "dt": 11,
        "imgurl": "http://p0.meituan.net/w.h/deal/2538b140a91c48abb15874b61d27b8f318284.jpg@0_0_641_388a|388h_640w_2e_90Q",
        "rate-count": 5841,
        "mlls": "39.907243,116.475424;39.929652,116.478661;39.938786,116.341759;39.95571,116.45937;39.922788,116.441271;39.89143,116.46958;39.857371,116.446789;39.983235,116.326783;39.912608,116.374527;40.129002,116.641809;39.894891,116.375275;39.826908,116.322433;39.96884,116.37054;39.89754,116.322314;40.066988,116.547436;39.933248,116.428933;39.981992,116.314691;39.908064,116.306828;39.79968,116.50915;39.966183,116.3231;39.992856,116.390395;39.846606,116.427854;39.910787,116.472024;39.921603,116.517421;39.88877,116.34177;39.983856,116.314368",
        "price": 3,
        "solds": 133818,
        "digestion": "",
        "end": 1577807999,
        "id": 608418706,
        "state": 32,
        "value": 6,
        "nobooking": 1,
        "slug": "608418706",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/2538b140a91c48abb15874b61d27b8f318284.jpg@126_0_389_389a|267h_267w_2e_90Q",
        "mtitle": "香滑蒸蛋1份",
        "smstitle": "真功夫香滑蒸蛋",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1565193600,
        "frontPoiCates": "1,36",
        "subcate": "209",
        "start": 1565193600,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 90,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 618191041,
            "price": 9.9,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.7,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "鸡骨浓汤酸辣粉"
        },
        "couponendtime": 1593532799,
        "mname": "西少爷肉夹馍",
        "title": "鸡骨浓汤酸辣粉1份",
        "brandname": "西少爷肉夹馍",
        "dt": 11,
        "imgurl": "http://p0.meituan.net/w.h/deal/273583edd498124595b3d37ac38b9006120306.jpg@0_58_800_484a|388h_640w_2e_90Q",
        "rate-count": 101,
        "mlls": "39.957859,116.46333;40.079931,116.346299;39.924608,116.316329;39.967788,116.296586;39.893307,116.375122;39.99328,116.33363;39.978165,116.315711;39.922649,116.440272;39.900433,116.493265;40.033059,116.418572;39.941112,116.352898;39.995992,116.481445;39.881769,116.34819;39.858513,116.435002;40.05305,116.30221;39.951368,116.27837;39.89685,116.41917;39.917473,116.529212;39.925044,116.594024;39.915746,116.436834;39.96169,116.43941;39.9461,116.37157;39.982137,116.306465;39.917825,116.460574;39.933322,116.458368;40.028338,116.311141;40.047302,116.431915;39.984674,116.334008;39.990375,116.432075;39.937042,116.515842;39.86689,116.29397;39.889895,116.656014;39.92339,116.4992;39.951495,116.54809;39.957814,116.348883;39.80286,116.50129;39.976056,116.306886;39.905845,116.358014;40.001615,116.490365;39.893935,116.479239;39.903467,116.246765;39.983565,116.306919;39.909272,116.472798;39.982717,116.315656;39.844376,116.316486",
        "price": 9.9,
        "solds": 3368,
        "digestion": "",
        "end": 1593532799,
        "id": 618191041,
        "state": 32,
        "value": 16,
        "nobooking": 1,
        "slug": "618191041",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/273583edd498124595b3d37ac38b9006120306.jpg@100_0_600_600a|267h_267w_2e_90Q",
        "mtitle": "鸡骨浓汤酸辣粉1份，提供免费WiFi",
        "smstitle": "西少爷肉夹馍鸡骨浓汤酸辣粉",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1572796800,
        "frontPoiCates": "1,36",
        "subcate": "209",
        "start": 1572796800,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 69,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 44503324,
            "price": 7.9,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.3,
        "channel": "food",
        "range": "西单",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "掉渣饼1份"
        },
        "couponendtime": 1579190399,
        "mname": "掉香缘掉渣饼",
        "title": "掉渣饼1份，提供免费WiFi",
        "brandname": "掉香缘掉渣饼",
        "dt": 11,
        "imgurl": "http://p1.meituan.net/w.h/deal/7fa4d4497aab7b81ced0d3081616e77262464.jpg@0_21_702_425a|388h_640w_2e_90Q",
        "rate-count": 1268,
        "mlls": "39.910385,116.375938",
        "price": 7.9,
        "solds": 35445,
        "digestion": "",
        "end": 1579190399,
        "id": 44503324,
        "state": 32,
        "value": 10,
        "nobooking": 1,
        "slug": "44503324",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/7fa4d4497aab7b81ced0d3081616e77262464.jpg@117_0_468_468a|267h_267w_2e_90Q",
        "mtitle": "掉渣饼1份，提供免费WiFi",
        "smstitle": "掉香缘掉渣饼掉渣饼",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1493265712,
        "frontPoiCates": "1,36",
        "subcate": "209",
        "start": 1493265712,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 86,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 43666854,
            "price": 19.9,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.4,
        "channel": "food",
        "range": "33店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "抢购芒果大虾卷"
        },
        "couponendtime": 1577980799,
        "mname": "村上一屋",
        "title": "抢购芒果大虾卷1份",
        "brandname": "村上一屋",
        "dt": 23,
        "imgurl": "http://p0.meituan.net/w.h/deal/96129d6eff69242fd0926b3405c2efcf77174.jpg@0_45_855_518a|388h_640w_2e_90Q",
        "rate-count": 2224,
        "mlls": "40.041926,116.421459;39.881871,116.460263;39.865493,116.435329;39.915924,116.411572;39.89714,116.45488;39.876401,116.664835;39.814602,116.454777;39.851282,116.398437;39.9191,116.452836;39.99364,116.33866;39.958174,116.359296;39.906364,116.462926;39.893393,116.474339;39.97894,116.42424;39.99485,116.41201;39.893966,116.434496;40.076631,116.323112;39.925015,116.591996;39.904565,116.640579;39.921835,116.517307;39.884596,116.477902;39.905393,116.455234;40.029925,116.310645;39.93247,116.478669;39.745074,116.1416;39.893461,116.375133;39.984195,116.304885;39.95308,116.318139;39.912189,116.303119;40.001124,116.490462",
        "price": 19.9,
        "solds": 35836,
        "digestion": "",
        "end": 1577980799,
        "id": 43666854,
        "state": 32,
        "value": 35,
        "nobooking": 1,
        "slug": "43666854",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/96129d6eff69242fd0926b3405c2efcf77174.jpg@123_0_608_608a|267h_267w_2e_90Q",
        "mtitle": "抢购芒果大虾卷1份，提供免费WiFi",
        "smstitle": "村上一屋抢购芒果大虾卷",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1487235027,
        "frontPoiCates": "1,28,20059",
        "subcate": "193",
        "start": 1487235027,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 90,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[2]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 52578723,
            "price": 9.99,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.2,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"2019-02-04\",\"useDay\":\"1\",\"endDate\":\"2019-02-10\"}",
          "81": "小份炒疙瘩"
        },
        "couponendtime": 1577289599,
        "mname": "紫光园",
        "title": "小份炒疙瘩3选1",
        "brandname": "紫光园",
        "dt": 27,
        "imgurl": "http://p1.meituan.net/w.h/deal/0e7d04db69d09b862b84fcb25c7ec651368492.jpg@0_170_2362_1431a|388h_640w_2e_90Q",
        "rate-count": 623,
        "mlls": "39.842024,116.469266;40.001406,116.412819;40.07234,116.43645;39.921785,116.45076;39.895192,116.677209;39.818352,116.546732;39.906577,116.441803;39.915748,116.481197;39.851028,116.308137;39.916097,116.505161;39.836227,116.378558;39.93907,116.36432;40.210773,116.256191;39.917579,116.443381;39.92454,116.467226;39.887818,116.445375;39.905613,116.647329;39.764239,116.332208;39.928561,116.587816;40.316292,116.630046;39.753389,116.556248;40.12978,116.634849",
        "price": 9.99,
        "solds": 8648,
        "digestion": "",
        "end": 1577289599,
        "id": 52578723,
        "state": 32,
        "value": 15,
        "nobooking": 1,
        "slug": "52578723",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/0e7d04db69d09b862b84fcb25c7ec651368492.jpg@295_0_1771_1771a|267h_267w_2e_90Q",
        "mtitle": "小份炒疙瘩3选1，建议2人使用，提供免费WiFi",
        "smstitle": "紫光园小份炒疙瘩3选1",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1533088529,
        "frontPoiCates": "59,1,20150",
        "subcate": "135",
        "start": 1533088529,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 85,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 601262619,
            "price": 7.5,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.3,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"specialCondition\":\"（中东新天地店）2019.8.17-2019.8.18，CoCo都可（生态园店）周日为固定公休日无法接待\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "芒果绿茶"
        },
        "couponendtime": 1577807999,
        "mname": "CoCo都可",
        "title": "芒果绿茶1份",
        "brandname": "CoCo都可",
        "dt": 179,
        "imgurl": "http://p0.meituan.net/w.h/deal/79f8bd41fc4339c21828be1982bced3117124.jpg@0_6_640_387a|388h_640w_2e_100Q",
        "rate-count": 54421,
        "mlls": "39.917322,116.529421;39.90592,116.46051;39.954234,116.317176;39.949104,116.344556;40.04771,116.43156;39.865848,116.423054;39.686655,116.320056;39.915933,116.411425;39.993424,116.468347;39.916362,116.555452;39.90594,116.123273;40.003132,116.406949;39.899128,116.457982;39.980364,116.381942;39.906396,116.226306;39.871895,116.310341;39.932034,116.453833;39.87733,116.326002;39.881796,116.455643;39.952698,116.356902;40.126693,116.650484;39.786269,116.323502;40.130754,116.651752;39.88537,116.462544;39.894199,116.479608;39.994444,116.456946;39.92269,116.17193;39.845661,116.555686;39.943883,116.2716;39.78514,116.495532;39.835712,116.28895;39.971489,116.43645;40.142888,116.657173;39.90643,116.2255;40.004557,116.416136;40.130571,116.650826;39.791539,116.340307;39.924008,116.597816;39.918955,116.442853;39.841715,116.415272;39.929208,116.673089;39.911342,116.374424;40.356152,116.835801;39.965456,116.323222;39.918906,116.451471;39.854411,116.366348;39.897443,116.319979;39.917067,116.460543;39.980676,116.314573;39.90721,116.65714;39.941642,116.416966;39.810204,116.504251;39.989524,116.482567;39.867119,116.293698;39.805764,116.459376;39.95886,116.28846;39.891105,116.635694;39.932127,116.477527;39.896609,116.41923;40.075922,116.319221;40.220355,116.232511;39.836378,116.377918;39.998781,116.482223;39.894687,116.462122;40.031589,116.417137;40.033528,116.418459;39.921481,116.433093;39.958649,116.28967;39.993024,116.338275;39.928395,116.277015;40.015256,116.270954;39.828482,116.474548;39.860783,116.355292;39.745755,116.139223;39.855717,116.397772;39.978768,116.461254;40.070341,116.414494;39.755957,116.16091;39.908687,116.307251;39.899677,116.417787;39.804434,116.501936;39.905089,116.642589;39.997869,116.40923;39.958149,116.462926;39.94618,116.292492;39.880905,116.68553;40.072209,116.336896;39.888674,116.341387;39.732289,116.142528;40.04283,116.35027;40.060076,116.415446;39.915119,116.420907;39.979346,116.314244;39.940014,116.43559;39.951691,116.547707;39.893679,116.479023;39.89631,116.419275;39.969585,116.307791;39.99213,116.339505;39.82449,116.298253",
        "price": 7.5,
        "solds": 1143860,
        "digestion": "",
        "end": 1577807999,
        "id": 601262619,
        "state": 32,
        "value": 9,
        "nobooking": 1,
        "slug": "601262619",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/79f8bd41fc4339c21828be1982bced3117124.jpg@120_0_400_400a|267h_267w_2e_100Q",
        "mtitle": "芒果绿茶1份",
        "smstitle": "CoCo都可芒果绿茶",
        "festcanuse": 0,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1560930900,
        "frontPoiCates": "1,11",
        "subcate": "190",
        "start": 1560930900,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 88,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 39195527,
            "price": 79.9,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.9,
        "channel": "food",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "单人自助"
        },
        "brandname": "铁木真",
        "dt": 173,
        "imgurl": "http://p1.meituan.net/w.h/deal/07fcf17d1b78b74f76c8305f3814d778132201.jpg@0_7_800_484a|388h_640w_2e_90q",
        "rate-count": 7167,
        "campaigns": [
          {
            "buystatus": 2,
            "color": "",
            "infourl": "",
            "campaignid": 99074885,
            "festival": "",
            "shorttag": "",
            "logo": "减",
            "longtitle": "立减5元，每人限购1张",
            "titleTag": "开业减5",
            "type": 3
          }
        ],
        "price": 79.9,
        "solds": 173433,
        "id": 39195527,
        "state": 32,
        "nobooking": 1,
        "slug": "39195527",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/45243c03ba50024edfd99372cc809c9a35494.jpg",
        "mtitle": "单人自助，提供免费WiFi",
        "festcanuse": 1,
        "canbuyprice": 74.9,
        "subcate": "217,191",
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "ctype": 0,
        "deposit": 0,
        "status": 0,
        "poiids": [],
        "campaignprice": 74.9,
        "range": "双桥",
        "couponendtime": 1577203199,
        "mname": "铁木真",
        "title": "单人自助",
        "strategyStid": 99074885,
        "mlls": "39.908415,116.577535",
        "digestion": "",
        "end": 1577203199,
        "value": 83,
        "smstitle": "单人自助",
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1467944496,
        "frontPoiCates": "1,40",
        "start": 1467944496,
        "showtype": "normal",
        "satisfaction": 70,
        "hide": 0,
        "applelottery": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ]
      },
      {
        "poiids": [],
        "mealcount": "[]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 50012241,
            "price": 92,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.5,
        "channel": "food",
        "range": "16店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"specialCondition\":\"法定节假日所有店不可用；哈德门店、安华店、槐房万达店、贵园里店、都一处前门店、力力豆花庄，便宜坊御膳饭庄店、航天桥店周六日不可用\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "13": "1"
        },
        "couponendtime": 1577462399,
        "mname": "便宜坊烤鸭店",
        "title": "100元代金券1张，可叠加",
        "brandname": "便宜坊烤鸭店",
        "dt": 27,
        "imgurl": "http://p0.meituan.net/w.h/deal/2bd5a61601a3563b12a4275168fab664271285.jpg@0_502_1123_680a|388h_640w_2e_90Q",
        "rate-count": 553,
        "mlls": "39.89702,116.39798;39.894021,116.447537;39.896237,116.417402;39.873246,116.408842;39.794562,116.4808;39.898774,116.41929;40.0003,116.351679;39.888481,116.410064;39.763309,116.492503;39.785298,116.515063;39.925468,116.286891;39.81441,116.36892;39.887284,116.431442;39.87394,116.42091;39.83549,116.285541;39.929554,116.478568",
        "price": 92,
        "solds": 15069,
        "digestion": "",
        "end": 1577462399,
        "id": 50012241,
        "state": 32,
        "value": 100,
        "nobooking": 1,
        "slug": "50012241",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/2bd5a61601a3563b12a4275168fab664271285.jpg@0_281_1123_1123a|267h_267w_2e_90Q",
        "mtitle": "100元代金券1张，全场通用，可叠加使用",
        "smstitle": "便宜坊烤鸭店代金券",
        "festcanuse": 0,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1522514257,
        "frontPoiCates": "1,393,20150,402,59",
        "subcate": "278,135,284",
        "start": 1522514257,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 59,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 37275055,
            "price": 64,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4,
        "channel": "food",
        "range": "2店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "单人自助餐"
        },
        "couponendtime": 1576857599,
        "mname": "好伦哥",
        "title": "单人自助餐",
        "brandname": "好伦哥",
        "dt": 173,
        "imgurl": "http://p1.meituan.net/w.h/deal/cd1d42675eabbf87f58c25571e1ca7a235379.jpg@0_0_460_278a|388h_640w_2e_90Q",
        "rate-count": 4172,
        "mlls": "39.984129,116.30479;39.965112,116.444093",
        "price": 64,
        "solds": 57509,
        "digestion": "",
        "end": 1576857599,
        "id": 37275055,
        "state": 32,
        "value": 66,
        "nobooking": 1,
        "slug": "37275055",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/cd1d42675eabbf87f58c25571e1ca7a235379.jpg@90_0_279_279a|267h_267w_2e_90Q",
        "mtitle": "单人自助餐，提供免费WiFi",
        "smstitle": "单人自助餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1460007873,
        "frontPoiCates": "1,40",
        "subcate": "217,191",
        "start": 1460007873,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 73,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[4]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 46396464,
            "price": 169,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.2,
        "channel": "food",
        "range": "5店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "北京牡丹烤鸭"
        },
        "couponendtime": 1576857599,
        "mname": "京味斋·北京牡丹烤鸭",
        "title": "北京牡丹烤鸭1只",
        "brandname": "京味斋·北京牡丹烤鸭",
        "dt": 27,
        "imgurl": "http://p0.meituan.net/w.h/deal/46b61be1d6c549a76918972d124290fa124464.jpg@0_12_1333_808a|388h_640w_2e_90Q",
        "rate-count": 2219,
        "mlls": "39.98138,116.36;39.951917,116.45415;39.992438,116.462469;39.93117,116.46693;39.934646,116.303386",
        "price": 169,
        "solds": 28901,
        "digestion": "",
        "end": 1576857599,
        "id": 46396464,
        "state": 32,
        "value": 198,
        "nobooking": 1,
        "slug": "46396464",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/46b61be1d6c549a76918972d124290fa124464.jpg@250_0_833_833a|267h_267w_2e_90Q",
        "mtitle": "北京牡丹烤鸭1只",
        "smstitle": "京味斋·北京牡丹烤鸭北京牡丹烤鸭",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1501007335,
        "frontPoiCates": "59,1,20150",
        "subcate": "135",
        "start": 1501007335,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 85,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 34212757,
            "price": 19.9,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.5,
        "channel": "food",
        "range": "常营",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "单人传统牛肉面"
        },
        "couponendtime": 1576857599,
        "mname": "东方宫中国兰州牛肉拉面",
        "title": "单人传统牛肉面，包间免费",
        "brandname": "东方宫中国兰州牛肉拉面",
        "dt": 174,
        "imgurl": "http://p1.meituan.net/w.h/deal/d020bbbdada56f48776b2f43836ce45944393.jpg@0_6_640_387a|388h_640w_2e_100q",
        "rate-count": 2761,
        "mlls": "39.924868,116.598423",
        "price": 19.9,
        "solds": 53139,
        "digestion": "",
        "end": 1576857599,
        "id": 34212757,
        "state": 32,
        "value": 26,
        "nobooking": 1,
        "slug": "34212757",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/d020bbbdada56f48776b2f43836ce45944393.jpg@120_0_400_400a|267h_267w_2e_100q",
        "mtitle": "单人传统牛肉面，包间免费，提供免费WiFi",
        "smstitle": "东方宫中国兰州牛肉拉面单人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1453213086,
        "frontPoiCates": "58,1",
        "subcate": "134",
        "start": 1453213086,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 90,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[2]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 37280423,
            "price": 88,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.5,
        "channel": "food",
        "range": "苹果园",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "脊骨土豆火锅套餐"
        },
        "couponendtime": 1577030399,
        "mname": "源味屋韩式火锅&炸鸡",
        "title": "脊骨土豆火锅套餐，建议2人使用",
        "brandname": "源味屋韩式火锅&炸鸡",
        "dt": 313,
        "imgurl": "http://p1.meituan.net/w.h/deal/9e7d5a9cbd492d03e143dbd445023b7775428.jpg@0_21_702_425a|388h_640w_2e_100Q",
        "rate-count": 17,
        "mlls": "39.925698,116.195327",
        "price": 88,
        "solds": 115,
        "digestion": "",
        "end": 1577030399,
        "id": 37280423,
        "state": 32,
        "value": 108,
        "nobooking": 1,
        "slug": "37280423",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/9e7d5a9cbd492d03e143dbd445023b7775428.jpg@117_0_468_468a|267h_267w_2e_100Q",
        "mtitle": "脊骨土豆火锅套餐，建议2人使用，提供免费WiFi",
        "smstitle": "源味屋韩式火锅&炸鸡2人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1460018456,
        "frontPoiCates": "17,1",
        "subcate": "189",
        "start": 1460018456,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 88,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "mealcount": "[]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 620742510,
            "price": 70,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4,
        "channel": "food",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "13": "1"
        },
        "brandname": "呷哺呷哺",
        "dt": 244,
        "imgurl": "http://p0.meituan.net/w.h/deal/2f51f3b2954ae6272977e9dd1894d08412088.jpg@0_0_640_387a|388h_640w_2e_100Q",
        "rate-count": 316,
        "campaigns": [
          {
            "buystatus": 2,
            "color": "",
            "infourl": "",
            "campaignid": 95365791,
            "festival": "",
            "shorttag": "",
            "logo": "减",
            "longtitle": "商家新客立减10元，每人限购1张",
            "titleTag": "新客减10",
            "type": 3
          }
        ],
        "price": 70,
        "solds": 12752,
        "id": 620742510,
        "state": 32,
        "nobooking": 1,
        "slug": "620742510",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/2f51f3b2954ae6272977e9dd1894d08412088.jpg@126_0_388_388a|267h_267w_2e_100Q",
        "mtitle": "70元代金券1张，全场通用",
        "festcanuse": 1,
        "canbuyprice": 60,
        "subcate": "278,284,189",
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "ctype": 0,
        "deposit": 0,
        "status": 0,
        "poiids": [],
        "campaignprice": 60,
        "range": "北京等",
        "couponendtime": 1577980799,
        "mname": "呷哺呷哺",
        "title": "70元代金券1张，全场通用",
        "strategyStid": 95365791,
        "mlls": "39.88591,116.42059;39.845355,116.42743;40.028904,116.276398;40.073298,116.435514;39.955683,116.459443;39.76259,116.186311;39.86607,116.50049;39.769942,116.503199;39.899717,116.491653;39.958611,116.287927;39.805067,116.36816;39.865466,116.429032;39.896635,116.375507;39.904869,116.459131;39.89368,116.47457;39.86728,116.422149;40.028576,116.312121;39.913885,116.410223;39.94013,116.52192;39.726795,115.961426;39.913335,116.279845;39.896871,116.4178;39.90815,116.303897;40.31508,116.63318;39.91037,116.376185;39.785189,116.49598;39.865888,116.269395;40.132839,116.646954;40.048245,116.43079;39.984966,116.490364;40.235348,116.170211;39.91227,116.30292;39.79794,116.419289;39.793917,116.365388;40.461237,115.978054;39.973708,116.295084;39.935306,116.449615;40.212134,116.239105;39.911426,116.374337;40.056979,116.329582;39.738716,116.331822;39.941117,116.353244;40.064177,116.55808;39.810036,116.164628;39.99794,116.29094;39.8574,116.446911;40.12578,116.657362;39.918418,116.700074;39.947222,116.371197;39.93782,116.103851;40.129272,116.642335;40.316187,116.630158;39.804839,116.501337;39.910804,116.373328;40.046334,116.602723;39.977357,116.366564;39.998508,116.481726;39.988464,116.304738;39.821766,116.523939;40.222157,116.264365;40.07632,116.319121;40.072177,116.337171;40.382739,116.85174;40.376969,116.859047;39.799644,116.574655;39.916389,116.451385;39.791233,116.499141;39.802039,116.480464;39.889746,116.254737;40.079634,116.311854;39.877332,116.326222;40.04726,116.337282;39.786728,116.326321;39.996645,116.477978;39.903751,116.636582;39.916801,116.554431;39.854346,116.282766;40.231608,116.190972;39.759541,116.545647;40.09661,116.288605;39.968214,116.461614;39.924297,116.612747;39.919543,116.442419;40.067055,116.347505;40.35547,116.834878;39.942176,116.435704;40.31415,116.6296;39.929669,116.47867;39.851893,116.399845;40.14642,117.094534;39.946475,116.371542;39.847634,116.320304;39.998079,116.409369;39.863869,116.47714;39.908071,116.202062;39.745518,116.140288;39.977971,116.406551;39.78374,116.29126;40.043547,116.349652;39.90763,116.44862",
        "digestion": "",
        "end": 1576684799,
        "value": 70,
        "smstitle": "呷哺呷哺代金券",
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1574092800,
        "frontPoiCates": "402,17,1,393",
        "start": 1574092800,
        "showtype": "normal",
        "satisfaction": 74,
        "hide": 0,
        "applelottery": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ]
      },
      {
        "poiids": [],
        "mealcount": "[2,3]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 55041969,
            "price": 188,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.4,
        "channel": "food",
        "range": "中关村",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "超值2-3人套餐"
        },
        "couponendtime": 1577462399,
        "mname": "巴四老城区炭火蛙锅",
        "title": "超值2-3人套餐",
        "brandname": "巴四老城区炭火蛙锅",
        "dt": 244,
        "imgurl": "http://p0.meituan.net/w.h/deal/d6a8341be7d0a47af64c51f4e98cee9793193.jpg@35_0_913_554a|388h_640w_2e_90Q",
        "rate-count": 213,
        "mlls": "39.979391,116.314159",
        "price": 188,
        "solds": 6323,
        "digestion": "",
        "end": 1577462399,
        "id": 55041969,
        "state": 32,
        "value": 271,
        "nobooking": 1,
        "slug": "55041969",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/d6a8341be7d0a47af64c51f4e98cee9793193.jpg@215_0_554_554a|267h_267w_2e_90Q",
        "mtitle": "超值2-3人套餐，提供免费WiFi",
        "smstitle": "巴四老城区炭火蛙锅2-3人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1546408116,
        "frontPoiCates": "17,1",
        "subcate": "189",
        "start": 1546408116,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 87,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 50816876,
            "price": 13,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.1,
        "channel": "food",
        "range": "20店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "超值单人餐"
        },
        "couponendtime": 1577289599,
        "mname": "华莱士炸鸡汉堡",
        "title": "鸡腿堡+薯条+中杯可乐1份",
        "brandname": "华莱士炸鸡汉堡",
        "dt": 10,
        "imgurl": "http://p0.meituan.net/w.h/deal/0be5db2a43e4772eb64d219630fe92f046534.jpg@0_43_601_364a|388h_640w_2e_90Q",
        "rate-count": 1064,
        "mlls": "39.864144,116.511615;39.882483,116.651162;40.21452,116.24441;40.07857,116.3294;39.890735,116.45848;39.797454,116.564129;40.028089,116.628068;39.98044,116.31603;39.929027,116.67194;39.905441,116.643161;39.893864,116.264357;39.909174,116.577629;39.921014,116.517672;39.86111,116.462537;39.990028,116.483287;39.772655,116.540059",
        "price": 13,
        "solds": 17041,
        "digestion": "",
        "end": 1577289599,
        "id": 50816876,
        "state": 32,
        "value": 31,
        "nobooking": 1,
        "slug": "50816876",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/0be5db2a43e4772eb64d219630fe92f046534.jpg@75_0_451_451a|267h_267w_2e_90Q",
        "mtitle": "鸡腿堡+薯条+中杯可乐1份，提供免费WiFi",
        "smstitle": "华莱士炸鸡汉堡鸡腿堡+薯条+中杯可乐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1525407989,
        "frontPoiCates": "1,36",
        "subcate": "209",
        "start": 1525407989,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 82,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 43179237,
            "price": 63,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.2,
        "channel": "food",
        "range": "双桥",
        "optionalattrs": {
          "11": "{\"startDate\":\"2018-02-13\",\"useDay\":\"1\",\"endDate\":\"2018-02-21\"}",
          "81": "单人自助"
        },
        "couponendtime": 1577375999,
        "mname": "金真子纸上烤肉",
        "title": "单人自助",
        "brandname": "金真子纸上烤肉",
        "dt": 171,
        "imgurl": "http://p0.meituan.net/w.h/deal/__26218165__2150172.jpg@0_53_267_161a|388h_640w_2e_90Q",
        "rate-count": 9002,
        "mlls": "39.913479,116.581379",
        "price": 63,
        "solds": 213366,
        "digestion": "",
        "end": 1577375999,
        "id": 43179237,
        "state": 32,
        "value": 66,
        "nobooking": 1,
        "slug": "43179237",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/__26218165__2150172.jpg",
        "mtitle": "单人自助，提供免费WiFi",
        "smstitle": "单人自助",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1483410797,
        "frontPoiCates": "1,40,54",
        "subcate": "217,191,194",
        "start": 1483410797,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 81,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[4,5]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 52100816,
            "price": 188,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.2,
        "channel": "food",
        "range": "2店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "4-5人套餐"
        },
        "couponendtime": 1588262399,
        "mname": "东来顺饭庄",
        "title": "4-5人套餐",
        "brandname": "东来顺饭庄",
        "dt": 237,
        "imgurl": "http://p1.meituan.net/w.h/deal/4b2bfab5d6d4da18316879ab3c75b4e633422.jpg@0_4_450_272a|388h_640w_2e_90q",
        "rate-count": 719,
        "mlls": "39.982234,116.307698;39.896381,116.462136",
        "price": 188,
        "solds": 11649,
        "digestion": "",
        "end": 1588262399,
        "id": 52100816,
        "state": 32,
        "value": 484,
        "nobooking": 1,
        "slug": "52100816",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/4b2bfab5d6d4da18316879ab3c75b4e633422.jpg@85_0_280_280a|267h_267w_2e_90q",
        "mtitle": "4-5人套餐",
        "smstitle": "东来顺饭庄4-5人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1530749455,
        "frontPoiCates": "17,1",
        "subcate": "189",
        "start": 1530749455,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 82,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[4]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 47611157,
            "price": 188,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.8,
        "channel": "food",
        "range": "13店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "四人焖锅套餐"
        },
        "couponendtime": 1578671999,
        "mname": "黄记煌三汁焖锅",
        "title": "四人焖锅套餐，包间免费",
        "brandname": "黄记煌三汁焖锅",
        "dt": 244,
        "imgurl": "http://p0.meituan.net/w.h/deal/a527823771a31bafbede6a85ae21fbf754047.jpg@0_50_702_425a|388h_640w_2e_90Q",
        "rate-count": 1356,
        "mlls": "39.865446,116.435283;40.128242,116.652661;39.801149,116.533663;40.01501,116.2711;39.81741,116.29216;39.972139,116.436591;39.922703,116.171524;39.958514,116.285656;39.951766,116.547722;39.88219,116.29733;39.924874,116.598753;39.805829,116.459505;39.972628,116.295055",
        "price": 188,
        "solds": 18236,
        "digestion": "",
        "end": 1578671999,
        "id": 47611157,
        "state": 32,
        "value": 227.4,
        "nobooking": 1,
        "slug": "47611157",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/a527823771a31bafbede6a85ae21fbf754047.jpg@88_0_526_526a|267h_267w_2e_90Q",
        "mtitle": "四人焖锅套餐，包间免费，提供免费WiFi",
        "smstitle": "黄记煌三汁焖锅4人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1508295354,
        "frontPoiCates": "17,1",
        "subcate": "189",
        "start": 1508295354,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 72,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 42789371,
            "price": 19,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.4,
        "channel": "food",
        "range": "4店通用",
        "optionalattrs": {
          "11": "{\"startDate\":\"2018-02-13\",\"specialCondition\":\"2019.1.28-2.14\",\"useDay\":\"1\",\"endDate\":\"2018-02-23\"}",
          "81": "螺蛳粉单人套餐"
        },
        "couponendtime": 1577462399,
        "mname": "螺蛳粉先生",
        "title": "螺蛳粉单人套餐，提供免费WiFi",
        "brandname": "螺蛳粉先生",
        "dt": 11,
        "imgurl": "http://p0.meituan.net/w.h/deal/79b27ced406fac9b66996e6ab41b9ad7166055.jpg@0_349_960_581a|388h_640w_2e_90Q",
        "rate-count": 753,
        "mlls": "39.970471,116.351043;39.951411,116.312936;39.981652,116.327743;40.22159,116.2443",
        "price": 19,
        "solds": 20297,
        "digestion": "",
        "end": 1577462399,
        "id": 42789371,
        "state": 32,
        "value": 25,
        "nobooking": 1,
        "slug": "42789371",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/79b27ced406fac9b66996e6ab41b9ad7166055.jpg@0_160_960_960a|267h_267w_2e_90Q",
        "mtitle": "螺蛳粉单人套餐，提供免费WiFi",
        "smstitle": "螺蛳粉先生单人餐",
        "festcanuse": 0,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1480746152,
        "frontPoiCates": "1,36",
        "subcate": "209",
        "start": 1480659752,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 89,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[2]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 46066044,
            "price": 218,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4,
        "channel": "food",
        "range": "北京等",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "豪华芝士排骨套餐"
        },
        "couponendtime": 1588521599,
        "mname": "火炉火烤肉·芝士排骨",
        "title": "豪华芝士排骨套餐，建议2人使用",
        "brandname": "火炉火烤肉·芝士排骨",
        "dt": 24,
        "imgurl": "http://p0.meituan.net/w.h/deal/fddf41cb204cbdd7cf2cef5251655c3257681.jpg@0_6_640_387a|388h_640w_2e_100Q",
        "rate-count": 3246,
        "mlls": "39.898887,116.418052;39.788231,116.326707;39.923996,116.518106",
        "price": 218,
        "solds": 36772,
        "digestion": "",
        "end": 1588521599,
        "id": 46066044,
        "state": 32,
        "value": 237,
        "nobooking": 1,
        "slug": "46066044",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/fddf41cb204cbdd7cf2cef5251655c3257681.jpg@120_0_400_400a|267h_267w_2e_100Q",
        "mtitle": "豪华芝士排骨套餐，建议2人使用，提供免费WiFi",
        "smstitle": "火炉火烤肉·芝士排骨2人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1499240862,
        "frontPoiCates": "1,20060,28",
        "subcate": "193",
        "start": 1499240862,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 77,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[4]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 35885121,
            "price": 218,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.9,
        "channel": "food",
        "range": "大钟寺",
        "optionalattrs": {
          "11": "{\"startDate\":\"2018-02-13\",\"useDay\":\"1\",\"endDate\":\"2018-02-23\"}",
          "81": "美味4人餐"
        },
        "couponendtime": 1577030399,
        "mname": "磁器铜锅涮肉",
        "title": "美味4人餐，提供免费WiFi",
        "brandname": "磁器铜锅涮肉",
        "dt": 237,
        "imgurl": "http://p1.meituan.net/w.h/deal/1d1ac8f594d1a59aa18b048109281b2057460.jpg@0_6_640_387a|388h_640w_2e_100q",
        "rate-count": 55,
        "mlls": "39.958637,116.347312",
        "price": 218,
        "solds": 726,
        "digestion": "",
        "end": 1577030399,
        "id": 35885121,
        "state": 32,
        "value": 313,
        "nobooking": 1,
        "slug": "35885121",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/1d1ac8f594d1a59aa18b048109281b2057460.jpg@120_0_400_400a|267h_267w_2e_100q",
        "mtitle": "美味4人餐，提供免费WiFi",
        "smstitle": "磁器铜锅涮肉4人餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1456457669,
        "frontPoiCates": "17,1",
        "subcate": "189",
        "start": 1456457669,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 76,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[2,3]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 42923555,
            "price": 125,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4.2,
        "channel": "food",
        "range": "前门/大栅栏",
        "optionalattrs": {
          "11": "{\"startDate\":\"2017-01-28,2017-02-11,2017-10-03\",\"specialCondition\":\"2019年9月22号\",\"useDay\":\"1\",\"endDate\":\"2017-02-02,2017-02-11,2017-10-06\"}",
          "81": "烤鸭2-3人餐"
        },
        "couponendtime": 1577894399,
        "mname": "九门轩烤鸭店",
        "title": "烤鸭2-3人餐，提供免费WiFi",
        "brandname": "九门轩烤鸭店",
        "dt": 27,
        "imgurl": "http://p1.meituan.net/w.h/deal/f8584d03ff2f0bc81fb2cf2975508bad54403.jpg@0_24_800_484a|388h_640w_2e_90Q",
        "rate-count": 5470,
        "mlls": "39.895157,116.397633",
        "price": 125,
        "solds": 37707,
        "digestion": "",
        "end": 1577894399,
        "id": 42923555,
        "state": 32,
        "value": 188,
        "nobooking": 1,
        "slug": "42923555",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/f8584d03ff2f0bc81fb2cf2975508bad54403.jpg@133_0_533_533a|267h_267w_2e_90Q",
        "mtitle": "烤鸭2-3人餐，提供免费WiFi",
        "smstitle": "九门轩烤鸭店2-3人餐",
        "festcanuse": 0,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1481599920,
        "frontPoiCates": "59,1,20150",
        "subcate": "135",
        "start": 1481599920,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 83,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "mealcount": "[]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 51996101,
            "price": 95,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 3.9,
        "channel": "food",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"specialCondition\":\"法定节假日不可用\",\"weekday\":\"6,7\",\"useDay\":\"0\",\"endDate\":\"\"}",
          "13": "1"
        },
        "brandname": "旺顺阁鱼头泡饼",
        "dt": 184,
        "imgurl": "http://p1.meituan.net/w.h/deal/3bf4587938b51e414e38483496daff5150100.jpg@5_0_659_400a|388h_640w_2e_90Q",
        "rate-count": 1082,
        "campaigns": [
          {
            "buystatus": 2,
            "color": "",
            "infourl": "",
            "campaignid": 37775790,
            "festival": "",
            "shorttag": "",
            "logo": "减",
            "longtitle": "商家新客首购立减50元，每人限购1张，每桌限用1张",
            "titleTag": "新客减50",
            "type": 3
          }
        ],
        "price": 95,
        "solds": 51379,
        "id": 51996101,
        "state": 32,
        "nobooking": 1,
        "slug": "51996101",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/3bf4587938b51e414e38483496daff5150100.jpg@135_0_400_400a|267h_267w_2e_90Q",
        "mtitle": "100元代金券1张，除酒水饮料外全场通用",
        "festcanuse": 0,
        "canbuyprice": 45,
        "subcate": "146,278,284",
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "ctype": 0,
        "deposit": 0,
        "status": 0,
        "poiids": [],
        "campaignprice": 45,
        "range": "北京等",
        "couponendtime": 1577375999,
        "mname": "旺顺阁鱼头泡饼",
        "title": "100元代金券1张，可叠加",
        "strategyStid": 37775790,
        "mlls": "39.867925,116.422206;39.753533,116.21157;39.899234,116.321865;40.127856,116.652743;40.067032,116.317312;39.949862,116.458516;39.74549,116.14083;40.230936,116.189979;39.953602,116.324617;39.837979,116.28551;39.868772,116.440787;39.824394,116.29914;39.94092,116.43982;39.990227,116.482496;40.02626,116.306574;39.86677,116.29391;39.917636,116.443202;39.97338,116.29508;39.90688,116.2362;39.9904,116.423699;39.982989,116.408961;39.836313,116.378281;39.909031,116.308199;39.917846,116.459718;40.009413,116.353846;39.860856,116.356651;39.962893,116.502404;39.926005,116.596102;40.032061,116.417265;39.905329,116.640452;39.809099,116.473507;39.910227,116.411012;39.936832,116.516046;39.878513,116.486632;39.906532,116.4774",
        "digestion": "",
        "end": 1577375999,
        "value": 100,
        "smstitle": "旺顺阁鱼头泡饼代金券",
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1530521139,
        "frontPoiCates": "402,24,1,393",
        "start": 1530521139,
        "showtype": "normal",
        "satisfaction": 71,
        "hide": 0,
        "applelottery": 0,
        "attrJson": [
          {
            "iconname": "无WiFi",
            "key": 3,
            "status": 0
          }
        ]
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 45581995,
            "price": 59.6,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4,
        "channel": "food",
        "range": "黄村",
        "optionalattrs": {
          "11": "{\"startDate\":\"2017-08-28,2017-12-24,2018-01-01,2018-02-14\",\"useDay\":\"1\",\"endDate\":\"2017-08-28,2017-12-25,2018-01-01,2018-02-17\"}",
          "81": "单人自助餐"
        },
        "couponendtime": 1577721599,
        "mname": "彼尔森啤酒健康烤肉",
        "title": "单人自助餐",
        "brandname": "彼尔森啤酒健康烤肉",
        "dt": 171,
        "imgurl": "http://p0.meituan.net/w.h/deal/25fb6734e8c7eda06df0029b5115693739483.jpg@0_6_640_387a|388h_640w_2e_100q",
        "rate-count": 6820,
        "mlls": "39.731466,116.343004",
        "price": 59.6,
        "solds": 222055,
        "digestion": "",
        "end": 1577721599,
        "id": 45581995,
        "state": 32,
        "value": 65,
        "nobooking": 1,
        "slug": "45581995",
        "squareimgurl": "http://p0.meituan.net/w.h/deal/25fb6734e8c7eda06df0029b5115693739483.jpg@120_0_400_400a|267h_267w_2e_100q",
        "mtitle": "单人自助餐，提供免费WiFi",
        "smstitle": "单人自助餐",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1496987267,
        "frontPoiCates": "1,40,54",
        "subcate": "217,191,194",
        "start": 1496987267,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 76,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      },
      {
        "poiids": [],
        "mealcount": "[1]",
        "pricecalendar": [
          {
            "buyprice": 0,
            "dealid": 44937038,
            "price": 89,
            "range": [],
            "endtime": 0,
            "id": 0,
            "starttime": 0,
            "type": 1,
            "desc": "平日"
          }
        ],
        "rating": 4,
        "channel": "food",
        "range": "天通苑",
        "optionalattrs": {
          "11": "{\"startDate\":\"\",\"useDay\":\"1\",\"endDate\":\"\"}",
          "81": "烤肉海鲜火锅自助"
        },
        "couponendtime": 1577721599,
        "mname": "永远爱小海鲜自助烤肉火锅",
        "title": "烤肉海鲜火锅自助",
        "brandname": "永远爱小海鲜自助烤肉火锅",
        "dt": 169,
        "imgurl": "http://p1.meituan.net/w.h/deal/ade710592871ea978be81e8255f4142d28071.jpg@0_13_440_266a|388h_640w_2e_100Q",
        "rate-count": 4415,
        "mlls": "40.060175,116.415413",
        "price": 89,
        "solds": 135975,
        "digestion": "",
        "end": 1577721599,
        "id": 44937038,
        "state": 32,
        "value": 98,
        "nobooking": 1,
        "slug": "44937038",
        "squareimgurl": "http://p1.meituan.net/w.h/deal/ade710592871ea978be81e8255f4142d28071.jpg@73_0_293_293a|267h_267w_2e_100Q",
        "mtitle": "烤肉海鲜火锅自助，提供免费WiFi",
        "smstitle": "烤肉海鲜火锅自助",
        "festcanuse": 1,
        "isAvailableToday": true,
        "cate": "1",
        "couponbegintime": 1494216702,
        "frontPoiCates": "1,40,63",
        "subcate": "141,217,191",
        "start": 1494216702,
        "dtype": 0,
        "bookinginfo": "",
        "titleTag": {},
        "showtype": "normal",
        "satisfaction": 75,
        "hide": 0,
        "ctype": 0,
        "applelottery": 0,
        "deposit": 0,
        "attrJson": [
          {
            "iconname": "免费WiFi",
            "key": 3,
            "status": 1
          }
        ],
        "status": 0
      }
    ],
    "tab": {
      "tabTitle": "全城热门",
      "normalTitle": "猜你喜欢"
    },
    "topics": {},
    "stid": "230454861061051370479975689323873479981",
    "paging": {
      "count": 30
    },
    "stids": [
      {
        "dealid": 606926100,
        "stid": "081153232802528897314002980212735700434_c0_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 606888388,
        "stid": "081153232802528897314002980212735700434_c1_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 48810374,
        "stid": "038619900732783535323317554726720300727_c2_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 619563064,
        "stid": "081153232802528897314002980212735700434_c3_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 47075977,
        "stid": "019032296837928515275757042931456002187_c4_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 608418706,
        "stid": "081153232802528897314002980212735700434_c5_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 618191041,
        "stid": "081153232802528897314002980212735700434_c6_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 44503324,
        "stid": "019032296837928515275757042931456002187_c7_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 43666854,
        "stid": "019032296837928515275757042931456002187_c8_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 52578723,
        "stid": "019032296837928515275757042931456002187_c9_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 601262619,
        "stid": "038619900732783535323317554726720300727_c10_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 39195527,
        "stid": "019032296837928515275757042931456002187_c11_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 50012241,
        "stid": "019032296837928515275757042931456002187_c12_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 37275055,
        "stid": "081153232802528897314002980212735700434_c13_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 46396464,
        "stid": "019032296837928515275757042931456002187_c14_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 34212757,
        "stid": "019032296837928515275757042931456002187_c15_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 37280423,
        "stid": "211872592785874234589030843637592674747_c16_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 620742510,
        "stid": "081153232802528897314002980212735700434_c17_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 55041969,
        "stid": "081153232802528897314002980212735700434_c18_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 50816876,
        "stid": "019032296837928515275757042931456002187_c19_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 43179237,
        "stid": "019032296837928515275757042931456002187_c20_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 52100816,
        "stid": "081153232802528897314002980212735700434_c21_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 47611157,
        "stid": "019032296837928515275757042931456002187_c22_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 42789371,
        "stid": "081153232802528897314002980212735700434_c23_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 46066044,
        "stid": "019032296837928515275757042931456002187_c24_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 35885121,
        "stid": "211872592785874234589030843637592674747_c25_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 42923555,
        "stid": "019032296837928515275757042931456002187_c26_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 51996101,
        "stid": "019032296837928515275757042931456002187_c27_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 45581995,
        "stid": "019032296837928515275757042931456002187_c28_e088a571c22347da6c7c5d1858e57d26a"
      },
      {
        "dealid": 44937038,
        "stid": "019032296837928515275757042931456002187_c29_e088a571c22347da6c7c5d1858e57d26a"
      }
    ]
  },
  menuInfo: [
    {title: '美食', icon: require('../images/icon_homepage_foodCategory.png')}, {
      title:
        '电影', icon: require('../images/icon_homepage_movieCategory.png')
    }, {
      title: '酒店', icon:
        require('../images/icon_homepage_hotelCategory.png')
    }, {
      title: 'KTV', icon:
        require('../images/icon_homepage_KTVCategory.png')
    }, {
      title: '优惠买单', icon:
        require('../images/icon_homepage_default.png')
    }, {
      title: '周边游', icon:
        require('../images/icon_homepage_foottreatCategory.png')
    }, {
      title: '生活服务', icon:
        require('../images/icon_homepage_lifeServiceCategory.png')
    }, {
      title: '休闲娱乐', icon:
        require('../images/icon_homepage_entertainmentCategory.png')
    }, {
      title: '丽人/美发', icon:
        require('../images/icon_homepage_beautyCategory.png')
    }, {
      title: '购物', icon:
        require('../images/icon_homepage_shoppingCategory.png')
    }, {title: '丽人/美发', icon: require('../images/icon_homepage_beautyCategory.png')},
    {title: '电影', icon: require('../images/icon_homepage_movieCategory.png')},
    {title: '周边游', icon: require('../images/icon_homepage_foottreatCategory.png')},
    {title: '酒店', icon: require('../images/icon_homepage_hotelCategory.png')},
    {title: '优惠买单', icon: require('../images/icon_homepage_default.png')},
    {title: '休闲娱乐', icon: require('../images/icon_homepage_entertainmentCategory.png')},
    {title: 'KTV', icon: require('../images/icon_homepage_KTVCategory.png')},
  ],
//首页打折活动
  actives: [{
    maintitle:"打折标题2",
     typeface_color:"#9e051a",
     deputytitle:"周五打折要的快来",
     imageurl:"https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1576089323253&di=db1f36fcf4606e85241f642a8e7a215c&imgtype=0&src=http%3A%2F%2Fwww.quanmama.com%2FAdminImageUpload%2Fueditor%2Fimage%2F20151215%2F6358579708299097543619484.png"
  },{
    maintitle:"打折标题2",
    typeface_color:"#39359e",
    deputytitle:"周四打折要的快来",
    imageurl:"https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1576089323253&di=db1f36fcf4606e85241f642a8e7a215c&imgtype=0&src=http%3A%2F%2Fwww.quanmama.com%2FAdminImageUpload%2Fueditor%2Fimage%2F20151215%2F6358579708299097543619484.png"
  },{
    maintitle:"打折标题3",
    typeface_color:"#943f9e",
    deputytitle:"周三打折要的快来",
    imageurl:"https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1576089323253&di=db1f36fcf4606e85241f642a8e7a215c&imgtype=0&src=http%3A%2F%2Fwww.quanmama.com%2FAdminImageUpload%2Fueditor%2Fimage%2F20151215%2F6358579708299097543619484.png"
  },
    {
      maintitle:"打折标题4",
      typeface_color:"#229e32",
      deputytitle:"周四打折要的快来",
      imageurl:"https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1576089323253&di=db1f36fcf4606e85241f642a8e7a215c&imgtype=0&src=http%3A%2F%2Fwww.quanmama.com%2FAdminImageUpload%2Fueditor%2Fimage%2F20151215%2F6358579708299097543619484.png"
    }]
}